content/post/2020-06-20-sparkkubernetes.org
#+title: Putting Spark on Kubernetes
#+date: 2020-06-20T08:51:27-0600
#+publishdate: 2020-06-20T08:51:27-0600
#+draft: t
#+tags[]: nil nil
#+description: short post description

# put text for summary prior to 'more' tag

Summarized text

# more

Rest of the post!

ref: [[https://towardsdatascience.com/ignite-the-spark-68f3f988f642][Ignite the Spark! - Towards Data Science]]

** Log in to your Docker registry
   #+begin_src bash
     docker login
   #+end_src

** Create namespace
   #+begin_src bash
     kubectl create ns spark
   #+end_src

** Set up RBAC
   We're doing a service account called =spark= 
   #+begin_src bash
     kubectl create serviceaccount spark -n spark
     kubectl create clusterrolebinding spark-role --clusterrole=edit --serviceaccount=spark:spark --namespace=spark
   #+end_src

* Build Docker images
  We will store these in our registry
  #+begin_src bash :session sh1
    wget -qO- http://apache.mirrors.hoobly.com/spark/spark-2.4.6/spark-2.4.6-bin-hadoop2.7.tgz | tar -xzf -
    cd spark-2.4.6-bin-hadoop2.7 && time bin/docker-image-tool.sh build
  #+end_src

** Create the Driver pod image
   We will use [[https://hub.docker.com/r/jupyter/pyspark-notebook/][Docker Hub pyspark-notebook]]

** Set up the deployment
*** Pull source from here                                          :noexport:
    + https://raw.githubusercontent.com/gregoryg/homelab/master/addons/pyspark-jupyter-notebook/jupyter-notebook-deploy.yaml
    + https://raw.githubusercontent.com/gregoryg/homelab/master/addons/pyspark-jupyter-notebook/jupyter-notebook-pvc.yaml
*** Create a persistent volume to hold notebooks and other code
    #+begin_src yaml
      apiVersion: v1
      kind: PersistentVolumeClaim
      metadata:
        finalizers:
        - kubernetes.io/pvc-protection
        name: jupyter-notebook-pvc
        namespace: spark
      spec:
        accessModes:
        - ReadWriteOnce
        resources:
          requests:
            storage: 4Gi
        storageClassName: longhorn
        volumeMode: Filesystem
    #+end_src
