docs/post/2020-06-20-sparkkubernetes/index.html
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml"  lang="en">
<head>
<meta charset="UTF-8" />
<meta name="viewport" content="width=device-width, initial-scale=1"/>

<title>Putting Spark on Kubernetes | Greg Grubbs | Hype Cyclist</title>

<meta property='og:title' content='Putting Spark on Kubernetes - Greg Grubbs | Hype Cyclist'>
<meta property='og:description' content='short post description'>
<meta property='og:url' content='https://hypecyclist.org/post/2020-06-20-sparkkubernetes/'>
<meta property='og:site_name' content='Greg Grubbs | Hype Cyclist'>
<meta property='og:type' content='article'><meta property='article:section' content='Post'><meta property='article:tag' content='nil'><meta property='article:tag' content='nil'><meta property='article:published_time' content='2020-06-20T08:51:27-06:00'/><meta property='article:modified_time' content='2020-06-20T08:51:27-06:00'/><meta name='twitter:card' content='summary'><meta name='twitter:site' content='@gregoryg'><meta name='twitter:creator' content='@gregoryg'>


<link href="https://hypecyclist.org/index.xml" rel="alternate" type="application/rss+xml" title="Greg Grubbs | Hype Cyclist" />

<link rel="stylesheet" href="/css/style.css"/><link rel='stylesheet' href='https://hypecyclist.org/css/custom.css'><link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="manifest" href="/site.webmanifest">
<link rel="mask-icon" href="/safari-pinned-tab.svg" color="#5bbad5">
<link rel="canonical" href="https://hypecyclist.org/post/2020-06-20-sparkkubernetes/">
<meta name="msapplication-TileColor" content="#da532c">
<meta name="theme-color" content="#ffffff">
</head>
 
<body>

<section class="section">
  <div class="container">
    <nav id="nav-main" class="nav">
      <div id="nav-name" class="nav-left">
        <a id="nav-anchor" class="nav-item" href="https://hypecyclist.org">
          <h1 id="nav-heading" class="title is-4">Greg Grubbs | Hype Cyclist</h1>
        </a>
      </div>
      <div class="nav-right">
        <nav id="nav-items" class="nav-item level is-mobile"><a class="level-item" aria-label="github" href='https://github.com/gregoryg'
            target='_blank' rel='noopener'>
            <span class="icon">
              <i class><svg viewbox='0 0 24 24' stroke-linecap='round' stroke-linejoin='round' stroke-width='2' aria-hidden='true'>
    
    <path d="M9 19c-5 1.5-5-2.5-7-3m14 6v-3.87a3.37 3.37 0 0 0-.94-2.61c3.14-.35 6.44-1.54 6.44-7A5.44 5.44 0 0 0 20 4.77 5.07 5.07 0 0 0 19.91 1S18.73.65 16 2.48a13.38 13.38 0 0 0-7 0C6.27.65 5.09 1 5.09 1A5.07 5.07 0 0 0 5 4.77a5.44 5.44 0 0 0-1.5 3.78c0 5.42 3.3 6.61 6.44 7A3.37 3.37 0 0 0 9 18.13V22"/>
    
  </svg></i>
            </span>
          </a><a class="level-item" aria-label="linkedin" href='https://linkedin.com/in/gregorygrubbs'
            target='_blank' rel='noopener'>
            <span class="icon">
              <i class><svg viewbox='0 0 24 24' stroke-linecap='round' stroke-linejoin='round' stroke-width='2' aria-hidden='true'>
    
    <path stroke-width="1.8" d="m5.839218,4.101561c0,1.211972 -0.974141,2.194011 -2.176459,2.194011s-2.176459,-0.982039 -2.176459,-2.194011c0,-1.211094 0.974141,-2.194011 2.176459,-2.194011s2.176459,0.982917 2.176459,2.194011zm0.017552,3.94922l-4.388022,0l0,14.04167l4.388022,0l0,-14.04167zm7.005038,0l-4.359939,0l0,14.04167l4.360816,0l0,-7.370999c0,-4.098413 5.291077,-4.433657 5.291077,0l0,7.370999l4.377491,0l0,-8.89101c0,-6.915523 -7.829986,-6.66365 -9.669445,-3.259423l0,-1.891237z"/>
    
  </svg></i>
            </span>
          </a></nav>
      </div>
    </nav>

    <nav class="nav">
      

      
      <div class="nav-right"><a class="nav-item" href="/about">
          <h2 class="title is-5">About</h2>
        </a><a class="nav-item" href="/post">
          <h2 class="title is-5">Blog</h2>
        </a></div>
      
    </nav>

  </div>
  <script src="/js/navicon-shift.js"></script>
</section>
<section class="section">
  <div class="container">
    <div class="subtitle tags is-6 is-pulled-right">
      
      
<a class="subtitle is-6" href="/tags/nil/">#nil</a>



  
  | <a class="subtitle is-6" href="/tags/nil/">#nil</a>
  


      
    </div>
    <h2 class="subtitle is-6">June 20, 2020</h2>
    <h1 class="title">Putting Spark on Kubernetes</h1>
    
    <div class="content">
      <p>
Summarized text</p>
<p>
Rest of the post!</p>
<p>
ref: <a href="https://towardsdatascience.com/ignite-the-spark-68f3f988f642">Ignite the Spark! - Towards Data Science</a></p>
<div id="outline-container-headline-1" class="outline-3">
<h3 id="headline-1">
Log in to your Docker registry
</h3>
<div id="outline-text-headline-1" class="outline-text-3">
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>  docker login</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Create namespace
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>  kubectl create ns spark</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
Set up RBAC
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<p>We&#39;re doing a service account called <code class="verbatim">spark</code> </p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>  kubectl create serviceaccount spark -n spark
</span></span><span style="display:flex;"><span>  kubectl create clusterrolebinding spark-role --clusterrole<span style="color:#666">=</span>edit --serviceaccount<span style="color:#666">=</span>spark:spark --namespace<span style="color:#666">=</span>spark</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
Build Docker images
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>We will store these in our registry</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>  wget -qO- http://apache.mirrors.hoobly.com/spark/spark-2.4.6/spark-2.4.6-bin-hadoop2.7.tgz | tar -xzf -
</span></span><span style="display:flex;"><span>  <span style="color:#a2f">cd</span> spark-2.4.6-bin-hadoop2.7 <span style="color:#666">&amp;&amp;</span> <span style="color:#a2f">time</span> bin/docker-image-tool.sh build</span></span></code></pre></div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Create the Driver pod image
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>We will use <a href="https://hub.docker.com/r/jupyter/pyspark-notebook/">Docker Hub pyspark-notebook</a></p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Set up the deployment
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<div id="outline-container-headline-8" class="outline-4">
<h4 id="headline-8">
Create a persistent volume to hold notebooks and other code
</h4>
<div id="outline-text-headline-8" class="outline-text-4">
<div class="src src-yaml">
<div class="highlight"><pre tabindex="0" style="background-color:#f8f8f8;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-yaml" data-lang="yaml"><span style="display:flex;"><span><span style="color:#bbb">  </span><span style="color:#008000;font-weight:bold">apiVersion</span>:<span style="color:#bbb"> </span>v1<span style="color:#bbb">
</span></span></span><span style="display:flex;"><span><span style="color:#bbb">  </span><span style="color:#008000;font-weight:bold">kind</span>:<span style="color:#bbb"> </span>PersistentVolumeClaim<span style="color:#bbb">
</span></span></span><span style="display:flex;"><span><span style="color:#bbb">  </span><span style="color:#008000;font-weight:bold">metadata</span>:<span style="color:#bbb">
</span></span></span><span style="display:flex;"><span><span style="color:#bbb">    </span><span style="color:#008000;font-weight:bold">finalizers</span>:<span style="color:#bbb">
</span></span></span><span style="display:flex;"><span><span style="color:#bbb">    </span>- kubernetes.io/pvc-protection<span style="color:#bbb">
</span></span></span><span style="display:flex;"><span><span style="color:#bbb">    </span><span style="color:#008000;font-weight:bold">name</span>:<span style="color:#bbb"> </span>jupyter-notebook-pvc<span style="color:#bbb">
</span></span></span><span style="display:flex;"><span><span style="color:#bbb">    </span><span style="color:#008000;font-weight:bold">namespace</span>:<span style="color:#bbb"> </span>spark<span style="color:#bbb">
</span></span></span><span style="display:flex;"><span><span style="color:#bbb">  </span><span style="color:#008000;font-weight:bold">spec</span>:<span style="color:#bbb">
</span></span></span><span style="display:flex;"><span><span style="color:#bbb">    </span><span style="color:#008000;font-weight:bold">accessModes</span>:<span style="color:#bbb">
</span></span></span><span style="display:flex;"><span><span style="color:#bbb">    </span>- ReadWriteOnce<span style="color:#bbb">
</span></span></span><span style="display:flex;"><span><span style="color:#bbb">    </span><span style="color:#008000;font-weight:bold">resources</span>:<span style="color:#bbb">
</span></span></span><span style="display:flex;"><span><span style="color:#bbb">      </span><span style="color:#008000;font-weight:bold">requests</span>:<span style="color:#bbb">
</span></span></span><span style="display:flex;"><span><span style="color:#bbb">        </span><span style="color:#008000;font-weight:bold">storage</span>:<span style="color:#bbb"> </span>4Gi<span style="color:#bbb">
</span></span></span><span style="display:flex;"><span><span style="color:#bbb">    </span><span style="color:#008000;font-weight:bold">storageClassName</span>:<span style="color:#bbb"> </span>longhorn<span style="color:#bbb">
</span></span></span><span style="display:flex;"><span><span style="color:#bbb">    </span><span style="color:#008000;font-weight:bold">volumeMode</span>:<span style="color:#bbb"> </span>Filesystem</span></span></code></pre></div>
</div>
</div>
</div>
