content/post/2020-06-20-sparkkubernetes.org
*** Create the deployment and service
    I'm using an image that runs the Jupyter notebook as an unpriviliged user =gregj= with
    a user ID and group ID of 1042.  This allows me to mount the persistent volume in that
    group so that my user has read/write access to the mounted volume

   #+begin_src yaml
     apiVersion: apps/v1
     kind: Deployment
     metadata:
       namespace: spark
       name: jupyter-notebook-deployment
       labels:
         app: jupyter-notebook
     spec:
       replicas: 1
       selector:
         matchLabels:
           app: jupyter-notebook
       template:
         metadata:
           labels:
             app: jupyter-notebook
         spec:
           serviceAccountName: spark
           securityContext:
             fsGroup: 1042
           imagePullSecrets:
           - name: regcred
           containers:
           - name: jupyter-notebook
             image: smeagol:5000/gjg-pyspark-notebook
             ports:
               - containerPort: 8888
             volumeMounts:
               - mountPath: /home/gregj/data
                 name: jupyter-notebook-pv
             workingDir: /home/gregj
             resources:
               limits:
                 memory: 2Gi
           volumes:
             - name: jupyter-notebook-pv
               persistentVolumeClaim:
                 claimName: jupyter-notebook-pvc
     ---
     # Headless service
     apiVersion: v1
     kind: Service
     metadata:
       namespace: spark
       name: jupyter-notebook-deployment
     spec:
       selector:
         app: jupyter-notebook
       ports:
         - protocol: TCP
           port: 29413
       clusterIP: None
   #+end_src

** Give a network entry to the Jupyter notebook
   #+begin_src bash
     kubectl expose deployment jupyter-notebook-deployment \
       --port=8888 --target-port=8888 \
       --type=LoadBalancer \
       --name=jupyter-frontend
   #+end_src

